run/3DmultiRegionReactiveBubble/baseMeshes/constant/surfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      surfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

normalMotionDir yes;

surfaceType interface;

twoFluids	yes;

motionDir (0 1 0); //(0 0 0);

muFluidA muFluidA [ 1 -1 -1 0 0 0 0 ] 0.031;

muFluidB muFluidB [ 1 -1 -1 0 0 0 0 ] 1.8e-5;

rhoFluidA rhoFluidA [ 1 -3  0 0 0 0 0 ] 998;

rhoFluidB rhoFluidB [ 1 -3  0 0 0 0 0 ] 1.205;

cleanSurfaceTension cleanSurfaceTension [ 1 0 -2 0 0 0 0 ] 0.073;

g g [ 0 1 -2 0 0 0 0 ] ( 0 -9.81 0);

fixedSurfacePatches 0 ();

pointNormalsCorrectionPatches 0 ();

nSurfaceCorrectors 1;

smoothing on;


cleanInterface no;

surfactantProperties
{
bulkConc            bulkConc            [ 0 -3  0 0  1 0 0 ] 1.0e-2;

saturatedConc       saturatedSurfConc   [ 0 -2  0 0  1 0 0 ] 5.0e-6;

adsorptionCoeff     adsorptionCoeff     [ 0  3 -1 0 -1 0 0 ] 40.0;

desorptionCoeff     desorptionCoeff     [ 0 -3  0 0  1 0 0 ] 8.93e-2;

bulkDiffusion       bulkDiffusion       [ 0  2 -1 0  0 0 0 ] 1.0e-9;

//diffusion           diffusion           [ 0  2 -1 0  0 0 0 ] 1.0e-9;
diffusion           diffusion           [ 0  2 -1 0  0 0 0 ] 1.0e-7;

temperature         temperature         [ 0  0  0 1  0 0 0 ] 293.0;
}

// ************************************************************************* //
