run/3DmultiRegionReactiveBubble/baseMeshes/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    interfaceShadow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    interface
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }
    space
    {
        type            inletOutlet;
        inletValue      uniform (0 -1e-06 0);
        value           uniform (0 -1e-06 0);
    }
}


// ************************************************************************* //
