run/3DmultiRegionReactiveBubble/baseMeshes/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   4;

//preservePatches();

method               manual;

manualCoeffs
{
	dataFile	"cellDecomposition";
}

//radialDecomposeBubble

bubbleRadius               0.002;

relProcessorsInterfaces    (0.8 1.2 4 8);


// ************************************************************************* //
